#language: ru

#language: ru

Функциональность: Профиль
  Сценарий: Успешное заполнение данных
    Когда Я перехожу к редактированию профиля
    И Я указываю фамилию "Seminarian"
    И Я указываю имя "Daria"
    И Я указываю отчество "Evgenevna"
    И Я указываю день рождения "1998-11-14"
    И Я перехожу далее
    И Я выбираю город "Voronezh"
    И Я перехожу далее
    И Я выбираю из интересов "Photo"
    И Я перехожу далее
    И Я заполняю заметку о себе "Test"
    И Я перехожу далее
    И Я перехожу к редактированию
    Тогда Я вижу заполненное поле фамилия
    И Я вижу заполненное поле имя
    И Я вижу заполненное поле отчество
    И Я вижу заполненное поле даты рождения
    Когда Я перехожу далее
    Тогда Я вижу заполненное поле города
    Когда Я перехожу далее
    Тогда Я вижу выбранные интересы
    Когда Я перехожу далее
    Тогда Я вижу заполненное поле заметки о себе
    Когда Я перехожу далее